Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: ru

source: An event that is called when a command has completed its invocation.
ru: Событие, которое вызывается, когда команда успешно вызвана

source: This event is called only if the command succeeded, i.e. all checks have passed and the user input it correctly.
ru: Вызывается только после успешного вызова команды

source: Called when bot receives a message.
ru: Вызывается, когда бот получает сообщение

source: Received message.
ru: Полученное сообщение

source: Called when bot replies with a message.
ru: Вызывается, когда бот отвечает на сообщение

source: Sent message.
ru: Отправленное сообщение

source: Called when message is edited.
ru: Вызывается, когда сообщение изменено

source: Edited message.
ru: Измененное сообщение

source: Called when typing state is changed (e.g. someone starts typing).
ru: Вызывается, когда изменяется состояние 'печатает' (к примеру кто-то начал печатать)

source: New state.
ru: Новое состояние

source: Called when user starts conversation using special button.
ru: Вызывается, когда пользователь использует кнопку 'Начать' в диалоге с ботом

source: Message sent when conversation is started.
ru: Сообщение, отправленное когда пользователь начал диалог

source: Called when user is kicked from the chat.
ru: Вызывается при удалении пользователя из чата

source: Message sent when user is kicked.
ru: Сообщение, отправленное, когда пользователь был удален

source: Called when user is invited to the chat.
ru: Вызывается при добавлении пользователя к чату

source: Message sent when user is invited.
ru: Сообщение, отправленное при приглашении пользователя

source: Called when user is invited to the chat by link.
ru: Вызывается при добавлении пользователя к чату посредством ссылки-приглашения

source: Called when chat photo is updated.
ru: Вызывается при обновлении фото чата

source: Message sent when photo is updated.
ru: Сообщение, отправленное при смене фото

source: Called when chat photo is removed.
ru: Вызывается при удалении фото чата

source: Message sent when photo is removed.
ru: Сообщение, отправленное при удалении фото

source: Called when chat is created.
ru: Вызывается при создании чата

source: Message sent when chat is created.
ru: Сообщение, отправленное при создании чата

source: Called when chat title is updated.
ru: Вызывается при обновлении названия чата

source: Message sent when chat title is updated.
ru: Сообщение, отправленное при смене названия чата

source: Called when message is pinned in chat.
ru: Вызывается при закреплении сообщения в чате

source: Message sent when message is pinned in chat.
ru: Сообщение, отправленное при закреплении сообщения в чате

source: Called when message is unpinned in chat.
ru: Вызывается при откреплении сообщения в чате

source: Message sent when message is unpinned in chat.
ru: Сообщение, отправленное при откреплении сообщения в чате

source: Called when user allows getting messages from bot.
ru: Вызывается, когда пользователь разрешает получение сообщений от бота

source: User who allowed messages.
ru: Пользователь, разрешивший получение сообщений

source: Called when user denies getting messages from bot.
ru: Вызывается, когда пользователь запрещает получение сообщения от бота

source: User who denied messages.
ru: Пользователь, запретивший получение сообщений

source: Called when new photo is uploaded to bot group.
ru: Вызывается, когда в группу бота загружено фото

source: Photo that got uploaded.
ru: Загруженное фото

source: Called when new audio is uploaded to bot group.
ru: Вызывается, когда в группу бота загружено аудио

source: Audio that got uploaded.
ru: Загруженное аудио

source: Called when new video is uploaded to bot group.
ru: Вызывается, когда в группу бота загружено видео

source: Video that got uploaded.
ru: Загруженное видео

source: Called when new comment is added to photo.
ru: Вызывается, когда к фото добавляется новый комментарий

source: Comment that got send.
ru: Добавленный комментарий

source: Called when comment on photo gets edited.
ru: Вызывается, когда под фото изменяется комментарий

source: Comment that got edited.
ru: Измененный комментарий

source: Called when comment on photo is restored.
ru: Вызывается, когда под фото восстанавливается комментарий

source: Comment that got restored.
ru: Восстановленный комментарий

source: Called when comment on photo is deleted.
ru: Вызывается, когда под фото удаляется комментарий

source: Comment that got deleted.
ru: Удаленный комментарий

source: Called when new comment is added to video.
ru: Вызывается, когда к видео добавляется новый комментарий

source: Called when comment on video gets edited.
ru: Вызывается, когда под видео изменяется комментарий

source: Called when comment on video is restored.
ru: Вызывается, когда под видео восстанавливается комментарий

source: Called when comment on video is deleted.
ru: Вызывается, когда под видео удаляется комментарий

source: Called when new comment is added to market.
ru: Вызывается, когда к товару добавляется новый комментарий

source: Called when comment on market gets edited.
ru: Вызывается, когда под товаром изменяется комментарий

source: Called when comment on market is restored.
ru: Вызывается, когда под товаром восстанавливается комментарий

source: Called when comment on market is deleted.
ru: Вызывается, когда под товаром удаляется комментарий

source: Called when new post is added to board.
ru: Вызывается, когда к обсуждению добавляется новый комментарий

source: New post on the board.
ru: Комментарий, добавленный к обсуждению

source: Called when post on board gets edited.
ru: Вызывается, когда в обсуждении изменяется комментарий

source: Post that got edited.
ru: Измененный комментарий

source: Called when post on board is restored.
ru: Вызывается, когда в обсуждении восстанавливается комментарий

source: Post that got restored.
ru: Восстановленный комментарий

source: Called when post on board is deleted.
ru: Вызывается, когда в обсуждении удаляется комментарий

source: Post that got deleted.
ru: Удаленный комментарий

source: Called when new post in added to wall.
ru: Вызывается, когда на стену добавляется пост

source: Post that got added.
ru: Добавленный пост

source: Called when wall post is reposted.
ru: Вызывается, когда пост со стены репостится

source: Post that got reposted.
ru: Репостнутый пост

source: Called when new comment is added to wall.
ru: Вызывается, когда на стену добавляется новый комментарий

source: Called when comment on wall gets edited.
ru: Вызывается, когда комментарий на стене изменяется

source: Called when comment on wall is restored.
ru: Вызывается, когда комментарий на стене восстанавливается

source: Called when comment on wall is deleted.
ru: Вызывается, когда комментарий на стене удаляется

source: Called when user joins bot group.
ru: Вызывается, когда пользователь присоединяется к группе

source: User that joined the group.
ru: Пользователь, присоединившийся к группе

source: User join type. Can be 'join' if user just joined, 'unsure' for events, 'accepted' if user was invited, 'approved' if user join request was approved or 'request' if user requested to join
ru: Тип присоединения. Может быть 'join' если пользователь просто присоединился, 'unsure' для событий, 'accepted' если пользователя приглашали, 'approved' если пользователя приняли или 'request' если пользователь запросил доступ в сообщество

source: Called when user leaves bot group.
ru: Вызывается, когда пользователь покидает группу

source: User that left the group.
ru: Пользователь, покинувший группу

source: If user left on their own (True) or was kicked (False).
ru: Покинул ли пользователь сам (True) или был исключен (False)

source: Called when user is blocked in bot group.
ru: Вызывается, когда пользователя блокируют в группе

source: User that was blocked.
ru: Пользователь, которого заблокировали

source: Called when user is unblocked in bot group.
ru: Вызывается, когда пользователя разблокируют в группе

source: User that was unblocked.
ru: Пользователь, которого разблокировали

source: Called when new poll vote is received.
ru: Вызывается, когда в опросе появляется новый голос

source: New vote.
ru: Новый голос

source: Called when group officers are edited.
ru: Вызывается, когда изменяются полномочия в группе

source: New edit.
ru: Изменение

source: Called when unknown event is received.
ru: Вызывается, когда получено неизвестное событие

source: Json payload of the event.
ru: Json события

source: Abstract Base Classes
ru: Абстрактные классы

source: An :term:`py:abstract base class` (also known as an ``abc``) is a class that models can inherit to get their behaviour. The Python implementation of an :doc:`abc <py:library/abc>` is slightly different in that you can register them at run-time. **Abstract base classes cannot be instantiated**. They are mainly there for usage with :func:`py:isinstance` and :func:`py:issubclass`\.
ru: :term:`py:abstract base class`, известные как ``abc`` - классы, которые определяют базовые модели, которые могут наследовать другие классы (:doc:`abc <py:library/abc>`). **Нельзя создавать экземпляры этих классов**. Они существуют в основном для использования с :func:`py:isinstance` и :func:`py:issubclass`

source: This library has a module related to abstract base classes, some of which are actually from the :doc:`abc <py:library/abc>` standard module, others which are not.
ru: Эта библиотека содержит раздел, посвященный абстрактным классам

source: An ABC that details the common operations on a model that can send messages.
ru: ABC, который определяет основные операции с моделями, способными получать сообщения

source: The following implement this ABC:
ru: Этот ABC используется для:

source: Utility Classes
ru: Дополнительные классы

source: Specifies the type of :class:`.Attachment`
ru: Определяет тип приложения

source: Attached photo
ru: Фото

source: Attached video
ru: Видео

source: Attached audio
ru: Аудио

source: Attached document
ru: Документ

source: Attached wall post
ru: Пост со стены

source: Attached market good
ru: Товар

source: Attached poll
ru: Опрос

source: Represents VK Attachment.
ru: Представляет собой приложение к сообщению

source: You can get str(:class:`.Attachment`) to get string representation used by VK API or pass it to :meth:`.Bot.send_message`
ru: Для получения строкового представления можно использовать str(:class:`.Attachment`) или просто передавать это как аргумент в :meth:`.Bot.send_message`

source: Id of attachment owner. Positive integer for users, negative for groups.
ru: Id владельца приложения. Положительное целое для пользователей, отрицательное для групп

source: Id of attachment itself. Positive integer.
ru: Id самого приложения. Положительное целое

source: Type of an attachment. Can be value from :class:`.AttachmentType` enum.
ru: Тип приложения. Может быть значением из :class:`.AttachmentType`

source: Represents Keyboard colors
ru: Определяет цвета клавиатуры

source: Primary color (blue)
ru: Основной цвет (синий)

source: Secondary color (gray)
ru: Вторичный цвет (серый)

source: Negative color (red)
ru: Отрицательный цвет (красный)

source: Positive color (green)
ru: Положительный цвет (зеленый)

source: Class for easier creation and changing of Bot Keyboards.
ru: Класс для удобного создания и изменения клавиатур ботов

source: Can be used in :meth:`.Bot.send_message` as it is
ru: Может использоваться в :meth:`.Bot.send_message` как есть

source: If keyboard is one-time (should disappear after one usage)
ru: Должна ли клавиатура быть одноразовой (исчезать после одного использования)

source: If keyboard should be inline. Restricts keyboard to be only 6x5
ru: Должна ли клавиатура быть прикреплена к сообщению. Ограничивает клавиатуру до 6x5

source: Classmethod for getting empty keyboard. Useful when keyboard should be cleared
ru: Метод класса для получения пустой клавиатуры. Удобно использовать для очищения клавиатуры

source: Adds button to current line
ru: Добавляет кнопку на текущую строку

source: Button label to be displayed
ru: Название кнопки

source: Button color. Can be value from :class:`.KeyboardColor` enum
ru: Цвет кнопки. Может быть значением из :class:`.KeyboardColor`

source: Optional. Should be used for some buttons
ru: Опционально. Используется для некоторых кнопок

source: When there are already too many buttons on one line
ru: Когда на строке уже слишком много кнопок

source: Adds location button to current line
ru: Добавляет кнопку местоположения на текущую строку

source: Payload for a location button
ru: Информация для кнопки местоположения

source: Hash for a VKPay button
ru: Хэш для кнопки VKPay

source: Payload for a VKPay button
ru: Информация для кнопки VKPay

source: Id of VK App
ru: Id приложения ВК

source: Id of VK App owner
ru: Id владельца приложения ВК

source: Hash for a VK App button
ru: Хэш для кнопки VKApp

source: Optional. Should be used for some button types
ru: Опционально. Используется для некоторых кнопок

source: Adds new line to the keyboard
ru: Добавляет новую строку на клавиатуру

source: When there are already too many lines in a keyboard
ru: Когда на клавиатуре уже слишком много кнопок

source: VK Models
ru: Модели VK

source: Models are classes that are received from VK and are not meant to be created by the user of the library.
ru: Модели - классы, которые получаются от VK и не должны быть созданы пользователем

source: The classes listed below are **not intended to be created by users** and are also **read-only**.
ru: Классы ниже **только для чтения**

source: For example, this means that you should not make your own :class:`User` instances nor should you modify the :class:`User` instance yourself.
ru: К примеру, это значит, что не стоит создавать или менять экземпляры класса :class:`User`

source: Represents a VK User.
ru: Представляет собой пользователя ВК

source: This class has a lot of unused attributes that won't be listed here, they are mainly based on VK API fields, so you should use VK API docs for them.
ru: Класс имеет в себе много неиспользуемых атрибутов, которые основаны вокруг полей пользователя в VK API, так что можно посмотреть их в документации VK API

source: All of the attributes can be None if not enough data is provided.
ru: Все атрибуты могут быть None при недостатке информации

source: Id of the user, positive integer
ru: Id пользователя, положительное целое

source: User's first name
ru: Имя пользователя

source: User's last name
ru: Фамилия пользователя

source: ``True`` if user's page is closed
ru: ``True`` если страница пользователя закрыта

source: ``True`` if bot can access user's page even if closed
ru: ``True`` если у бота есть доступ к закрытой странице пользователя

source: 1 for female, 2 for male, 0 for not specified
ru: 1 - женский, 2 - мужской, 0 - не определен

source: Represents a VK Group
ru: Представляет собой сообщество ВК

source: Id of group, positive int
ru: Id группы, положительное целое

source: Display name of the group
ru: Название группы

source: Screen name of the group (link part after vk.com/)
ru: Короткая ссылка на группу

source: ``True`` if group is closed
ru: ``True``, если группа закрыта

source: Can be either `event`, `group` or `page` depending on group type
ru: Может быть`event`, `group` или `page` в зависимости от типа группы

source: Has group photo urls with different sizes
ru: Разные размеры фото группы

source: Represents any message sent or received by bot.
ru: Представляет собой любое сообщение, отправленное или полученное ботом

source: Should only be created using :meth:`.Bot.build_msg`
ru: Должно создаваться только через :meth:`.Bot.build_msg`

source: Id of the message in conversation
ru: Id сообщения в диалоге

source: Do not try to use this parameter in group chats with Bot, as it will always be 0 and cause errors.
ru: Не пытайтесь использовать этот параметр в групповых чатах, так как он всегда будет 0 и будет вызывать ошибки

source: Datetime when message was sent
ru: Дата/время отправки сообщения

source: Datetime when message was updated
ru: Дата/время изменения сообщения

source: Id of conversation where message was sent
ru: Id диалога, где отправлено сообщение

source: Id of message author
ru: Id автора сообщения

source: Text of the message. Can be empty
ru: Текст сообщения. Может быть пустым

source: List of attachments delivered with message
ru: Список приложений к сообщению

source: List of forwarded messages
ru: Список пересланных сообщений

source: Message that this message replied to
ru: Сообщение, в ответ на которое было отправлено данное

source: Action payload
ru: Информация о действии

source: Coroutine to edit the message. Depends on message_id.
ru: Корутина для изменения сообщения

source: As it depends on message id, it does not work in group chats. At least as long as VK API does not provide message_id there
ru: Так как он зависит от id сообщения, он не работает в групповых чатах. По крайней мере пока вк не начнет возвращать id сообщения для них

source: New text of the message.
ru: Новый текст сообщения

source: New attachment to the message.
ru: Новые приложения к сообщению

source: ``True`` if fwd_messages should be kept. Defaults to ``True``
ru: ``True`` если стоит сохранить пересланные сообщения. По умолчанию ``True``

source: ``True`` if snippets should be kept. Defaults to ``True``
ru: ``True`` если стоит сохранить сниппеты. По умолчанию ``True``

source: Sends a message to the destination as a reply to original message.
ru: Отправляет сообщение как ответ к изначальному

source: |coro| Alternative for :meth:`.Message.get_user`
ru: |coro| Альтернатива для :meth:`.Message.get_user`

source: Exceptions
ru: Ошибки

source: Base exception class for vk_botting
ru: Базовый класс ошибки для vk_botting

source: Ideally speaking, this could be caught to handle any exceptions thrown from this library.
ru: В идеале, он может быть использован для обработки всех ошибок, вызываемых библиотекой

source: Exception for most of errors sent by VK API in responses
ru: Ошибка для большинства ошибок, возвращаемых VK Api в своих ответах

source: The base exception type for all command related errors.
ru: Базовая ошибка для всех ошибок, связанных с командами

source: This inherits from :exc:`VKException`.
ru: Является наследником :exc:`VKException`

source: This exception and exceptions inherited from it are handled in a special way as they are caught and passed into a special event from :class:`.Bot`\, :func:`on_command_error`.
ru: Эта ошибка и ее наследники обрабатываются особым образом в специальном событии :func:`on_command_error`

source: Exception raised when a command is attempted to be invoked but no command under that name is found.
ru: Ошибка, вызываемая когда не найдена команда с подходящим именем

source: This is not raised for invalid subcommands, rather just the initial main command that is attempted to be invoked.
ru: Не вызывается при неверных подкомандах

source: This inherits from :exc:`CommandError`.
ru: Является наследником :exc:`CommandError`

source: Exception raised when the command being invoked is disabled.
ru: Ошибка, вызываемая, когда вызыванная команда выключена

source: This inherits from :exc:`CommandError`
ru: Является наследником :exc:`CommandError`

source: Exception raised when the command being invoked is on cooldown. This inherits from :exc:`CommandError`
ru: Ошибка, вызываемая когда вызыванная команда на кулдауне. Является наследником :exc:`CommandError`

source: A class with attributes ``rate``, ``per``, and ``type`` similar to the :func:`.cooldown` decorator.
ru: Класс с атрибутами ``rate``, ``per`` и ``type``, аналогичный декоратору :func:`.cooldown`

source: The amount of seconds to wait before you can retry again.
ru: Количество секунд, которое необходимо ждать до следующего использования команды

source: Exception raised when the predicates in :attr:`.Command.checks` have failed.
ru: Ошибка, вызываемая при провале проверок из :attr:`.Command.checks`

source: Exception that's thrown when an operation in the :class:`Client` fails.
ru: Ошибка, вызываемая когда возникает проблема с :class:`Client`

source: These are usually for exceptions that happened due to user input.
ru: Обычно возникает из-за кривого ввода пользователя

source: Exception raised when the command being invoked raised an exception. This inherits from :exc:`CommandError`
ru: Ошибка, вызываемая при возникновении ошибки при вызове команды. Наследник :exc:`CommandError`

source: The original exception that was raised. You can also get this via the ``__cause__`` attribute.
ru: Изначальная ошибка. Может быть получена с помощью атрибута ``__cause__``

source: The base exception type for errors that involve errors regarding arguments.
ru: Базовая ошибка для ошибок, связанных с аргументами команд

source: Exception raised when a parsing or conversion failure is encountered on an argument to pass into a command.
ru: Ошибка, возникающая при ошибке парсинга или преобразования аргументов

source: This inherits from :exc:`ArgumentError`
ru: Наследник :exc:`ArgumentError`

source: Exception raised when a :data:`typing.Union` converter fails for all its associated types. This inherits from :exc:`ArgumentError`
ru: Ошибка, возникающая при ошибке преобразования к всем типам :data:`typing.Union`. Наследник :exc:`ArgumentError`

source: The parameter that failed being converted.
ru: Параметр, который не удалось преобразовать

source: A tuple of converters attempted in conversion, in order of failure.
ru: Кортеж использованных преобразователей

source: A list of errors that were caught from failing the conversion.
ru: Список ошибок, вызванных проблемой при преобразовании

source: Exception raised when parsing a command and a parameter that is required is not encountered.
ru: Ошибка, возникшая при нехватке пропаршенных аргументов для команды

source: The argument that is missing.
ru: Отсутствующий аргумент

source: Exception raised when the command was passed too many arguments and its :attr:`.Command.ignore_extra` attribute was not set to ``True``.
ru: Ошибка, возникающая когда команде было передано слишком много аргументов и атрибут :attr:`.Command.ignore_extra` был на ``True``

source: Exception raised when a Converter class raises non-CommandError. This inherits from :exc:`CommandError`.
ru: Ошибка, возникающая когда преобразователь вызывает ошибку, отличную от :exc:`CommandError`. наследник :exc:`CommandError`

source: The converter that failed.
ru: Преобразователь, который вызвал ошибку

source: Base exception for extension related errors.
ru: Базовая ошибка для ошибок, связанных с расширениями

source: The extension that had an error.
ru: Расширение, вызвавшее ошибку

source: An exception raised when an extension has already been loaded.
ru: Ошибка, вызванная когда расширение уже было загружено

source: This inherits from :exc:`ExtensionError`
ru: Наследник :exc:`ExtensionError`

source: An exception raised when an extension was not loaded.
ru: Ошибка, вызываемая, когда расширение не загружено

source: An exception raised when an extension does not have a ``setup`` entry point function.
ru: Ошибка, вызываемая, когда в расширении нет функции ``setup``

source: An exception raised when an extension failed to load during execution of the module or ``setup`` entry point.
ru: Ошибка, вызываемая когда расширение провалилось при выполнении или в функции ``setup``

source: The extension that had the error.
ru: Расширение, вызвавшее ошибку

source: An exception raised when an extension is not found.
ru: Ошибка, вызываемая когда расширение не найдено

source: Always ``None`` for backwards compatibility.
ru: Тут могла быть ваша реклама ver.2

source: An exception raised when the parser encounters a quote mark inside a non-quoted string.
ru: Ошибка, вызываемая когда парсер находит кавычку внутри строки, не ограниченной кавычками
