Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: ru

source: The name of the cog to remove.
ru: Название cog'а для удаления.

source: Remove a :class:`.Command` or subclasses from the internal list of commands.
ru: Удаляет команду (:class:`.Command` или сабкласс) из внутреннего списка команд.

source: This could also be used as a way to remove aliases.
ru: Может быть использован и для удаления альтернативных названий.

source: The name of the command to remove.
ru: Названия команды для удаления.

source: The command that was removed. If the name is not valid then `None` is returned instead.
ru: Удаленная команда. Если имя было неверным, то `None`

source: :class:`.Command` or subclass
ru: :class:`.Command` или сабкласс

source: Removes a listener from the pool of listeners.
ru: Удаляет событие из списка событий.

source: The function that was used as a listener to remove.
ru: Функция, которая была привязана к событию.

source: The name of the event we want to remove. Defaults to ``func.__name__``.
ru: Название события, которое надо удалить. По умолчанию - имя функции

source: A blocking call that abstracts away the event loop initialisation from you.
ru: Блокирующий вызов, который позволяет не инициализировать цикл самостоятельно.

source: This function must be the last function to call due to the fact that it is blocking. That means that registration of events or anything being called after this function call will not execute until it returns.
ru: Эта функция должна быть последней вызванной в коде, так как она блокирующая. Это значит что регистрация событий, команд и т.д. после нее не будут работать.

source: Bot token. Should be group token or user token with access to group
ru: Токен бота. Должен быть токеном группы или токеном пользователя с доступом к группе.

source: Should only be passed alongside user token. Owner id of group to connect to
ru: Должен отправляться только вместе с токеном пользователя. Id группы, к которой надо подключиться

source: Sends a message to the given destination with the text given.
ru: Отправляет сообщение данному получателю с данным текстом

source: The content must be a type that can convert to a string through ``str(message)``.
ru: Текст должен быть типом, который можно преобразовать в строку с помощью ``str(message)``.

source: If the content is set to ``None`` (the default), then the ``attachment`` or ``sticker_id`` parameter must be provided.
ru: Если сообщение - ``None`` (по умолчанию), то должен быть предоставлен параметр ``attachment`` или ``sticker_id``.

source: If the ``attachment`` parameter is provided, it must be :class:`str`, List[:class:`str`], :class:`.Attachment` or List[:class:`.Attachment`]
ru: Если есть параметр ``attachment``, он должен быть :class:`str`, List[:class:`str`], :class:`.Attachment` или List[:class:`.Attachment`]

source: If the ``keyboard`` parameter is provided, it must be :class:`str` or :class:`.Keyboard` (recommended)
ru: Если есть параметр ``keyboard``, он должен быть :class:`str` или :class:`.Keyboard` (предпочтительно)

source: Id of conversation to send message to
ru: Id получателя сообщения

source: The text of the message to send.
ru: Текст сообщения

source: The attachment to the message sent.
ru: Приложение к сообщению

source: Sticker_id to be sent.
ru: Id стикера, который надо отправить

source: The keyboard to send along message.
ru: Клавиатура, которую надо отправить вместе с сообщением

source: A message id to reply to.
ru: Id сообщения, на которое надо ответить

source: Message ids to be forwarded along with message.
ru: Id сообщений, которые надо переслать.

source: The message that was sent.
ru: Сообщение, которое было отправлено

source: Unloads an extension. When the extension is unloaded, all commands, listeners, and cogs are removed from the bot and the module is un-imported. The extension can provide an optional global function, ``teardown``, to do miscellaneous clean-up if necessary. This function takes a single parameter, the ``bot``, similar to ``setup`` from :meth:`~.Bot.load_extension`.
ru: Выгружает расширение. Когда расширение выгружено, все команды, события и cog'и, связанные с ним, тоже удаляются. У расширения так же может быть функция ``teardown`` для чистки всего, что осталось, если это необходимо. Она, аналогично ``setup``, должна принимать один параметр - bot

source: The extension name to unload. It must be dot separated like regular Python imports if accessing a sub-module. e.g. ``foo.test`` if you want to import ``foo/test.py``.
ru: Название расширения для выгрузки. Должно иметь в себе точку, повторяя синтаксис импорта в обычном Python (к примеру foo.test для файла foo/test.py).

source: Upload a document to conversation with given peer_id.
ru: Загружает документ в диалог с данным peer_id

source: Returns ready-to-use in send_message attachment.
ru: Возвращает attachment, готовый к использованию в send_message

source: Peer_id of the destination. The uploaded document cannot be used outside of given conversation.
ru: Peer_id назначения. Загруженный документ нельзя использовать вне данного диалога.

source: Path to document to upload. Can be relative.
ru: Путь к документу, который надо загрузить. Может быть относительным.

source: Uploaded document type. Can be value from :class:`.DocType` enum.
ru: Тип загруженного документа. Может быть значением из :class:`.DocType`

source: Title for uploaded document. Filename by default.
ru: Название для загруженного документа. По умолчанию имя файла.

source: :class:`.Attachment` instance representing uploaded document.
ru: Экземпляр :class:`.Attachment`, представляющий загруженный документ

source: Upload a photo to conversation with given peer_id.
ru: Загружает изображение в диалог с данным peer_id

source: Peer_id of the destination. The uploaded photo cannot be used outside of given conversation.
ru: Peer_id назначения. Загруженное изображение нельзя использовать вне данного диалога

source: Path to image to upload. Can be relative.
ru: Путь к изображению, которое надо загрузить. Может быть относительным.

source: Url of image to upload. Should be a direct url to supported image format, otherwise wont work.
ru: Ссылка на изображение, которое надо загрузить. Это должна быть прямая ссылка на поддерживаемый формат изображений, иначе не сработает.

source: :class:`.Attachment` instance representing uploaded photo.
ru: Экземпляр :class:`.Attachment`, представляющий загруженное фото.

source: Implements abstract VK Api method request.
ru: Реализует абстрактный запрос к методам VK Api

source: String representation of method name (e.g. 'users.get')
ru: Название метода в виде строки (к примеру 'users.get')

source: If request should be POST. Defaults to true. Changing this is not recommended
ru: Должен ли запрос быть POST. По умолчанию ``True``. Не рекомендуется менять этот параметр.

source: Payload arguments to send along with request .. note:: access_token and v parameters should not be passed as they are automatically added from current bot attributes
ru: Аргументы для отправки вместе с запросом. .. note:: access_token и v отправлять не надо, они автоматически добавляются из настроек текущего бота

source: Payload arguments to send along with request
ru: Аргументы для отправки вместе с запросом.

source: access_token and v parameters should not be passed as they are automatically added from current bot attributes
ru: access_token и v отправлять не надо, они автоматически добавляются из настроек текущего бота

source: Dict representation of json response received from the server
ru: Ответ от сервера, представленный в виде :class:`dict`

source: Waits for an event to be dispatched.
ru: Ожидает определенное событие.

source: This could be used to wait for a user to reply to a message or to edit a message in a self-containedway.
ru: Может быть использован, к примеру, чтобы ждать ответа пользователя или пока тот изменит сообщение внутри команды.

source: The ``timeout`` parameter is passed onto :func:`asyncio.wait_for`. By default, it does not timeout. Note that this does propagate the :exc:`asyncio.TimeoutError` for you in case of timeout and is provided for ease of use.
ru: Параметр ``timeout`` передается напрямую в :func:`asyncio.wait_for`. По умолчанию, ждет неопределенно долго. Учтите, что в случае истечения времени вызывается :exc:`asyncio.TimeoutError`.

source: In case the event returns multiple arguments, a :class:`tuple` containing those arguments is returned instead. Please check the :ref:`documentation <vk_api_events>` for a list of events and their parameters.
ru: В случае если событие возвращает множество аргументов, возвращается :class:`tuple`, содержащий их. Пожалуйста, обращайтесь к :ref:`documentation <vk_api_events>` для справки о событиях и их параметрах

source: This function returns the **first event that meets the requirements**.
ru: Функция возвращает **первое** событие, удовлетворяющее условиям

source: Examples
ru: Примеры

source: Waiting for a user reply: ::
ru: Ожидание ответа пользователя: ::

source: The event name, similar to the :ref:`event reference <vk_api_events>`, but without the ``on_`` prefix, to wait for.
ru: Название события, как и в :ref:`event reference <vk_api_events>`, но без префикса ``on_``.

source: A predicate to check what to wait for. The arguments must meet the parameters of the event being waited for.
ru: Проверка для события, которое надо ожидать. Аргументы должны соответствовать параметрам события, который ожидается.

source: The number of seconds to wait before timing out and raising :exc:`asyncio.TimeoutError`.
ru: Количество секунд для ожидания. По истечении вызывает :exc:`asyncio.TimeoutError`.

source: If a timeout is provided and it was reached.
ru: Если время ожидание было предоставлено и достигнуто

source: Returns no arguments, a single argument, or a :class:`tuple` of multiple arguments that mirrors the parameters passed in the :ref:`event reference <vk_api_events>`.
ru: Возвращает один аргумент, :class:`tuple` из нескольких аргументов, или не возвращает вообще, в зависимости от события. Пожалуйста, обращайтесь к :ref:`documentation <vk_api_events>` для справки о событиях и их параметрах

source: An iterator that recursively walks through all commands and subcommands.
ru: Итератор, который рекурсивно проходит по всем командам и подкомандам.

source: A callable that implements a command prefix equivalent to being mentioned. These are meant to be passed into the :attr:`.Bot.command_prefix` attribute.
ru: Функция, которая реализует префикс команды, аналогичный обращению к боту. Должна передаваться как атрибут :attr:`.Bot.command_prefix`

source: A callable that implements when mentioned or other prefixes provided. These are meant to be passed into the :attr:`.Bot.command_prefix` attribute.
ru: Функция, которая реализует префикс команды, аналогичный обращению к боту, а также все предоставленные префиксы. Должна передаваться как атрибут :attr:`.Bot.command_prefix`

source: This callable returns another callable, so if this is done inside a custom callable, you must call the returned callable, for example:
ru: Эта функция возвращает другую функцию, так что если она используется внутри собственной функции, то должна возвращать возвращенную функцию. К примеру:

source: A callable that implements when mentioned or bot gets pm. These are meant to be passed into the :attr:`.Bot.command_prefix` attribute.
ru: Функция, которая реализует префикс команды, аналогичный обращению к боту, а также принимает любое сообщение за команду, в случае если боту пишут в ЛС. Должна передаваться как атрибут :attr:`.Bot.command_prefix`

source: A callable that implements when mentioned, pm or other prefixes provided. These are meant to be passed into the :attr:`.Bot.command_prefix` attribute.
ru: Функция, которая реализует префикс команды, аналогичный обращению к боту, принимает любое сообщение за команду, в случае если боту пишут в ЛС, а также реализует все предоставленные префиксы. Должна передаваться как атрибут :attr:`.Bot.command_prefix`

source: Represents the context in which a command is being invoked under.
ru: Представляет собой контекст с которым должна вызываться команда.

source: This class contains a lot of meta data to help you understand more about the invocation context. This class is not created manually and is instead passed around to commands as the first parameter.
ru: Этот класс содержит кучу информации, которая поможет вам понять контекст вызова команды. Класс не должен создаваться вручную и вместо этого должен передаваться командам как первый параметр.

source: This class implements the :class:`~vk_botting.abstract.Messageable` ABC.
ru: Класс является экземпляром абстрактного класса :class:`~vk_botting.abstract.Messageable`

source: The message that triggered the command being executed.
ru: Сообщение, которое вызвало команду.

source: The bot that contains the command being executed.
ru: Бот, у которого зарегистрирована вызываемая команда.

source: The list of transformed arguments that were passed into the command. If this is accessed during the :func:`on_command_error` event then this list could be incomplete.
ru: Список преобразованных аргументов, переданных команде. Если используется в событии :func:`on_command_error`, то может быть неполным

source: A dictionary of transformed arguments that were passed into the command. Similar to :attr:`args`\, if this is accessed in the :func:`on_command_error` event then this dict could be incomplete.
ru: Словарь преобразованных аргументов, переданных команде. Аналогично :attr:`args`, если используется в событии :func:`on_command_error`, то может быть неполным

source: The prefix that was used to invoke the command.
ru: Префикс, использованный для вызова команды

source: The command (i.e. :class:`.Command` or its subclasses) that is being invoked currently.
ru: Команда (:class:`.Command` или сабкласс), которую контекст вызывает

source: The command name that triggered this invocation. Useful for finding out which alias called the command.
ru: Название команды, которая была вызвана. Можно использовать, чтобы понять, какое альтернативное название было использовано для вызова.

source: The subcommand (i.e. :class:`.Command` or its subclasses) that was invoked. If no valid subcommand was invoked then this is equal to ``None``.
ru: Подкоманда (:class:`.Command` или сабкласс), которая была вызвана. ``None`` если подкоманды не были использованы

source: The string that was attempted to call a subcommand. This does not have to point to a valid registered subcommand and could just point to a nonsense string. If nothing was passed to attempt a call to a subcommand then this is set to ``None``.
ru: Строка, которая пыталась вызвать подкоманду. Не обязательно указывает на существующую подкоманду, может просто являться бредом или, в случае, если ничего не было передано, ``None``.

source: Optional[:class:`str`]
ru: Опциональный[:class:`str`]

source: A boolean that indicates if the command failed to be parsed, checked, or invoked.
ru: Логическая переменная, обозначающая что провалилась подготовка, проверка или вызов команды.

source: Calls a command with the arguments given.
ru: Вызывает команду с данными аргументами.

source: This is useful if you want to just call the callback that a :class:`.Command` holds internally.
ru: Можно использовать в случае если необходимо просто вызвать функцию, которая привязана к команде.

source: This does not handle converters, checks, cooldowns, pre-invoke, or after-invoke hooks in any matter. It calls the internal callback directly as-if it was a regular function.
ru: Не вызывает преобразователи, проверки, задержки или связанные события. Просто вызывает связанную функцию.

source: You must take care in passing the proper arguments when using this function.
ru: В эту функцию очень важно передавать верные аргументы.

source: The first parameter passed **must** be the command being invoked.
ru: Первым параметром **должна быть** вызываемая команда.

source: A command or subclass of a command that is going to be called.
ru: Команда или ее сабкласс, которую необходимо вызвать

source: The arguments to to use.
ru: Аргументы для вызова

source: The keyword arguments to use.
ru: Аргументы с ключевыми словами для вызова

source: Calls the command again.
ru: Заново вызывает команду

source: This is similar to :meth:`~.Context.invoke` except that it bypasses checks, cooldowns, and error handlers.
ru: Аналог :meth:`~.Context.invoke`, но пропускает проверки, задержки и обработчики ошибок

source: If you want to bypass :exc:`.ArgumentError` derived exceptions, it is recommended to use the regular :meth:`~.Context.invoke` as it will work more naturally. After all, this will end up using the old arguments the user has used and will thus just fail again.
ru: Если необходимо избежать :exc:`.ArgumentError` или ее наследников, то стоит использовать обычный :meth:`~.Context.invoke`, так как иначе будут использованы те же аргументы и возвращена та же ошибка

source: Whether to call the before and after invoke hooks.
ru: Вызывать ли связанные события

source: Whether to start the call chain from the very beginning or where we left off (i.e. the command that caused the error). The default is to start where we left off.
ru: Начинать ли вызов команды с начала или с момента, где бот остановился (к примеру команда, вызвавшая ошибку). По умолчанию - с места остановки

source: |coro| Shorthand for :meth:`.Message.reply`
ru: |coro| Сокращение для :meth:`.Message.reply`

source: |coro| Returns the author of original message as instance of :class:`.User` class
ru: |coro| Возвращает автора сообщения как экземпляр :class:`.User` class

source: |coro| Alternative for :meth:`.Context.get_user`
ru: |coro| Альтернатива для :meth:`.Context.get_user`

source: Returns the cog associated with this context's command. None if it does not exist.
ru: Возвращает cog, связанный с командой или ``None``, если такого не существует

source: Checks if the invocation context is valid to be invoked with.
ru: Проверяет, верен ли контекст для вызова

source: Shorthand for :attr:`.Message.from_id`
ru: Сокращение для :attr:`.Message.from_id`

source: Shorthand for :attr:`.Message.peer_id`
ru: Сокращение для :attr:`.Message.peer_id`

source: Shorthand for :attr:`.Message.text`
ru: Сокращение для :attr:`.Message.text`

source: Returns bot :class:`.Group` or :class:`.User`, depending on whether it is :class:`.Bot` or :class:`.UserBot`
ru: Возвращает экземпляр :class:`.Group` или :class:`.User`, в зависимости от используемого токена.

source: Sends a message to the destination with the text given.
ru: Отправляет сообщение в ответ с данным текстом.

source: Triggers typing state of bot.
ru: Включает боту состояние 'печатает'

source: Can be used instead of :meth:`.typing` in some cases.
ru: Может быть использовано вместо :meth:`.typing` в некоторых случаях

source: Typing state ends in 10 seconds or when message is sent.
ru: Состояние 'печатает' выключается через 10 секунд или при отправке ответа

source: Json payload result of VK API request.
ru: Результат вызова к VK Api

source: Returns a context manager that allows you to type for an indefinite period of time.
ru: Возвращает контекстный менеджер, который позволяет поддерживать состояние 'печатает' неопределенное количество времени

source: This is useful for denoting long computations in your bot.
ru: Может быть использовано для долгих операций бота в командах

source: This is both a regular context manager and an async context manager. This means that both ``with`` and ``async with`` work with this.
ru: Может использоваться и как синхронный контекстный менеджер, и как асинхроный. То есть и ``with`` и ``async with`` будут работать

source: Example Usage: ::
ru: Пример использования: ::

source: Event Reference
ru: Справка по событиям

source: This page outlines the different types of events listened by :class:`Bot`.
ru: Эта страница описывает различные события, которые слушает :class:`Bot`

source: There are two ways to register an event, the first way is through the use of :meth:`Bot.listen`. The second way is through subclassing :class:`Bot` and overriding the specific events. For example: ::
ru: Есть два способа зарегистрировать события: через :meth:`Bot.listen` или создать сабкласс :class:`Bot` и перезаписать события. К примеру: ::

source: If an event handler raises an exception, :func:`on_error` will be called to handle it, which defaults to print a traceback and ignoring the exception.
ru: Если обработчик события вызывает ошибку, то вызывается функция :func:`on_error` для ее обработки. По умолчанию она выводит ошибку и игнорирует ее

source: All the events must be a |coroutine_link|_. If they aren't, then you might get unexpected errors. In order to turn a function into a coroutine they must be ``async def`` functions.
ru: Все события должны быть корутинами(|coroutine_link|_). Если они таковыми не являются, то можно получить неожиданные ошибки. Чтобы функция стала корутиной, ее надо объявлять через ``async def``

source: Called when the bot is done preparing the data received from VK. Usually after login is successful and the :attr:`Bot.group` and co. are filled up.
ru: Вызывается, когда бот закончил подготовку информации, полученной от VK Api. Обычно - после успешного входа и когда подготовлены атрибуты :attr:`Bot.group` и прочие

source: Usually when an event raises an uncaught exception, a traceback is printed to stderr and the exception is ignored. If you want to change this behaviour and handle the exception for whatever reason yourself, this event can be overridden. Which, when done, will suppress the default action of printing the traceback.
ru: Обычно, когда событие вызывает ошибку, в stderr выводится traceback и ошибка игнорируется. Если вы хотите изменить это поведение и обрабатывать ошибки самостоятельно, можно переобъявить эту функцию.

source: The information of the exception raised and the exception itself can be retrieved with a standard call to :func:`sys.exc_info`.
ru: Информация о ошибке и сама ошибка получаются стандартным вызовом :func:`sys.exc_info`

source: If you want exception to propagate out of the :class:`Bot` class you can define an ``on_error`` handler consisting of a single empty :ref:`py:raise`. Exceptions raised by ``on_error`` will not be handled in any way by :class:`Bot`.
ru: Если необходимо, чтобы ошибка выходила за пределы бота, то можно просто вызывать ошибку внутри ``on_error`` (:ref:`py:raise`). Если внутри ``on_error`` вызвана ошибка, то бот никак не будет ее обрабатывать.

source: The name of the event that raised the exception.
ru: Названия события, вызвавшего ошибку

source: The positional arguments for the event that raised the exception.
ru: Позиционные аргументы для события, вызвавшего ошибку

source: The keyword arguments for the event that raised the exception.
ru: Аргументы с ключевыми словами для события, вызвавшего ошибку

source: An error handler that is called when an error is raised inside a command either through user input error, check failure, or an error in your own code.
ru: Обработчик ошибок, вызываемый, когда ошибка вызвана внутри команды посредством ошибки ввода пользователя, проверки или ошибки в вашем коде

source: A default one is provided (:meth:`Bot.on_command_error`).
ru: По умолчанию - :meth:`Bot.on_command_error`

source: The invocation context.
ru: Контекст вызова команды

source: The error that was raised.
ru: Вызванная ошибка

source: An event that is called when a command is found and is about to be invoked.
ru: Событие, которое вызывается когда команда найдена и будет вызвана

source: This event is called regardless of whether the command itself succeeds via error or completes.
ru: Это событие вызывается вне зависимости от возможных ошибок в команде
