Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: ru

source: This inherits from :exc:`ArgumentError`.
ru: Наследник :exc:`ArgumentError`

source: The quote mark that was found inside the non-quoted string.
ru: Кавычка, найденная внутри строки, не ограниченной кавычками

source: An exception raised when a space is expected after the closing quote in a string but a different character is found.
ru: Ошибка, вызываемая когда пробел должен быть после закрывающей кавычки, но найден другой символ

source: The character found instead of the expected string.
ru: Символ, найденный вместо пробела

source: An exception raised when a quote character is expected but not found.
ru: Ошибка, вызываемая когда ожидается кавычка, но ее нет

source: The quote character expected.
ru: Ожидаемая кавычка

source: Exception that's thrown when bot fails to login with provided token for some reason
ru: Ошибка, вызываемая когда боту не удается зайти с предоставленным токеном по какой-то причине

source: Additional Classes
ru: Дополнительные классы

source: A mixin that implements common functionality for classes that are allowed to register commands.
ru: Mixin, который определяет часто используемый функционал для классов, которые могут регистрировать команды

source: A mapping of command name to :class:`.Command` or subclass objects.
ru: Связь названий команд с экземплярами :class:`.Command` или сабклассов

source: Whether the commands should be case insensitive. Defaults to ``False``.
ru: Должны ли команды быть невосприимчивыми к регистру. По умолчанию ``False``

source: A class that implements the protocol for a bot text command.
ru: Класс, определяющий текстовую команду бота

source: These are not created manually, instead they are created via the decorator or functional interface.
ru: Не создаются вручную, вместо этого они создаются с помощью декоратора

source: The name of the command.
ru: Название команды

source: The coroutine that is executed when the command is called.
ru: Корутина, вызываемая, когда вызвана команда

source: The list of aliases the command can be invoked under.
ru: Список альтернативных названий для команды

source: A boolean that indicates if the command is currently enabled. If the command is invoked while it is disabled, then :exc:`.DisabledCommand` is raised to the :func:`.on_command_error` event. Defaults to ``True``.
ru: Логическая переменная, обозначающая что команда включена. По умолчанию ``True``

source: The parent command that this command belongs to. ``None`` if there isn't one.
ru: Родительская команда для данной. ``None`` если таковой нет

source: The cog that this command belongs to. ``None`` if there isn't one.
ru: Cog, к которому принадлежит команда. ``None`` если такого нет

source: A list of predicates that verifies if the command could be executed with the given :class:`.Context` as the sole parameter. If an exception is necessary to be thrown to signal failure, then one inherited from :exc:`.CommandError` should be used. Note that if the checks fail then :exc:`.CheckFailure` exception is raised to the :func:`.on_command_error` event.
ru: Список проверок, которые подтверждают, что команда должна быть вызвана, принимающих на вход :class:`.Context` как единственный параметр. Если команда не проходит проверки, то в :func:`.on_command_error` подается :exc:`.CheckFailure`

source: If ``False`` and a keyword-only argument is provided then the keyword only argument is stripped and handled as if it was a regular argument that handles :exc:`.MissingRequiredArgument` and default values in a regular matter rather than passing the rest completely raw. If ``True`` then the keyword-only argument will pass in the rest of the arguments in a completely raw matter. Defaults to ``False``.
ru: Если ``False`` и есть аргумент с ключевым словом, то он обрабатывается как обычный аргумент, который обрабатывает :exc:`.MissingRequiredArgument` и значения по умолчанию как обычно вместо того, чтобы передавать аргумент как сырую строку

source: The subcommand that was invoked, if any.
ru: Подкоманда, которая была вызвана, если такая есть

source: If ``True``\, ignores extraneous strings passed to a command if all its requirements are met (e.g. ``?foo a b c`` when only expecting ``a`` and ``b``). Otherwise :func:`.on_command_error` and local error handlers are called with :exc:`.TooManyArguments`. Defaults to ``True``.
ru: Если ``True``, игнорирует лишние аргументы, переданные команде. Иначе вызывается :exc:`.TooManyArguments`

source: If ``True``\, cooldown processing is done after argument parsing, which calls converters. If ``False`` then cooldown processing is done first and then the converters are called second. Defaults to ``False``.
ru: Если ``True``, то обработка перезарядки происходит после парсинга аргументов, иначе до

source: Adds a check to the command. This is the non-decorator interface to :func:`.check`.
ru: Добавляет проверку к команде. Это :func:`.check`, только без декоратора

source: The function that will be used as a check.
ru: Функция, которая будет использоваться для проверки

source: Removes a check from the command. This function is idempotent and will not raise an exception if the function is not in the command's checks.
ru: Удаляет проверку с команды. Если такой проверки нет, не вызовет ошибку

source: The function to remove from the checks.
ru: Функция, которую необходимо удалить из проверок

source: Updates :class:`Command` instance with updated attribute.
ru: Обновляет экземпляр :class:`Command` с новыми атрибутами

source: This works similarly to the :func:`.command` decorator in terms of parameters in that they are passed to the :class:`Command` or subclass constructors, sans the name and callback.
ru: Работает аналогично декоратору :func:`.command` в плане параметров

source: Creates a copy of this command.
ru: Создает копию команды

source: Retrieves the parameter OrderedDict without the context or self parameters.
ru: Получает параметр OrderedDict без параметров контекста и self

source: Useful for inspecting signature.
ru: Удобно для исследования подписей

source: Retrieves the fully qualified parent command name.
ru: Получает имя команды

source: This the base command name required to execute it. For example, in ``?one two three`` the parent name would be ``one two``.
ru: Базовое имя команды, которое необходимо для ее выполнения

source: Retrieves the parents of this command.
ru: Получает родительские команды для данной

source: If the command has no parents then it returns an empty :class:`list`.
ru: Если у команды нет родительских команд, то возвращает пустой :class:`list`

source: For example in commands ``?a b c test``, the parents are ``[c, b, a]``.
ru: К примеру для команды ``?a b c test`` родительские команды - ``[c, b, a]``

source: Retrieves the root parent of this command.
ru: Получает коренные родительские команды данной

source: If the command has no parents then it returns ``None``.
ru: Если у команды нет родительских команд, возвращает ``None``

source: For example in commands ``?a b c test``, the root parent is ``a``.
ru: К примеру в команде ``?a b c test`` вернет ``a``

source: Retrieves the fully qualified command name.
ru: Получает имя команды

source: This is the full parent name with the command name as well. For example, in ``?one two three`` the qualified name would be ``one two three``.
ru: Это полное имя родительских команд и самой команды

source: Checks whether the command is currently on cooldown.
ru: Проверяет на перезарядке ли команда

source: The invocation context to use when checking the commands cooldown status.
ru: Контекст вызова команды для проверки на перезарядку

source: A boolean indicating if the command is on cooldown.
ru: Логическая переменная, показывающая на перезарядке ли команда

source: Resets the cooldown on this command.
ru: Обнуляет перезарядку команды

source: The invocation context to reset the cooldown under.
ru: Контест команды, перезарядку которой надо обнулить

source: A decorator that registers a coroutine as a local error handler.
ru: Декоратор, который регистрирует корутину как локальный обработчик ошибок

source: A local error handler is an :func:`.on_command_error` event limited to a single command. However, the :func:`.on_command_error` is still invoked afterwards as the catch-all.
ru: Локальный обработчик ошибок это :func:`.on_command_error`, работающий только на одну команду

source: The coroutine to register as the local error handler.
ru: Корутина, регистрируемая как локальный обработчик ошибок

source: A decorator that registers a coroutine as a pre-invoke hook.
ru: Декоратор, который вызывает корутину прямо перед вызовом команды

source: A pre-invoke hook is called directly before the command is called. This makes it a useful function to set up database connections or any type of set up required.
ru: Удобно чтобы подготовить подключения, например

source: This pre-invoke hook takes a sole parameter, a :class:`.Context`.
ru: Корутина должна принимать один параметр - :class:`.Context`

source: See :meth:`.Bot.before_invoke` for more info.
ru: См. :meth:`.Bot.before_invoke` для дополнительной информации

source: A decorator that registers a coroutine as a post-invoke hook.
ru: Декоратор, вызывающий корутину сразу после вызова команды

source: A post-invoke hook is called directly after the command is called. This makes it a useful function to clean-up database connections or any type of clean up required.
ru: Удобно использовать для чистки подключений и еще чего-нибудь

source: This post-invoke hook takes a sole parameter, a :class:`.Context`.
ru: Сама корутина должна принимать один параметр - :class:`.Context`

source: See :meth:`.Bot.after_invoke` for more info.
ru: См. :meth:`.Bot.after_invoke` для дополнительной информации

source: The name of the cog this command belongs to. None otherwise.
ru: Имя cog'а, к которому принадлежит команда. Если такого нет, то None

source: Checks if the command can be executed by checking all the predicates inside the :attr:`.checks` attribute. This also checks whether the command is disabled.
ru: Проверяет, может ли команда быть вызвана засчет проверки всех проверок внутри атрибута :attr:`.checks`. Еще проверяет, выключена ли команда

source: The ctx of the command currently being invoked.
ru: Параметр ctx вызванной команды

source: Any command error that was raised during a check call will be propagated by this function.
ru: Любая ошибка, возникшая во время выполнения функции будет обработана этой функцией

source: A boolean indicating if the command can be invoked.
ru: Логическая переменная, обозначающая может ли команда быть вызвана

source: Class that represent Client for interation with VK Api
ru: Класс, представляющий собой Клиент для взаимодействий с VK Api

source: Should not be used outside of :class:`.Bot`, as it is not intended and will probably not work
ru: Не должен использоваться вне класса :class:`.Bot`, так как не будет работать
