Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: ru

source: API Reference
ru: Справочник по API

source: Represents a VK bot. This class is a subclass of :class:`vk_botting.client.Client` and as a result anything that you can do with a :class:`vk_botting.client.Client` you can do with this bot.
ru: Представляет собой бота ВК. Это сабкласс :class:`.Client`, поэтому все, что можно делать с :class:`.Client`, можно делать и с ним

source: This class also subclasses :class:`.GroupMixin` to provide the functionality to manage commands.
ru: Так же это сабкласс :class:`.GroupMixin`, потому у него есть функционал для работы с командами

source: The command prefix is what the message content must contain initially to have a command invoked. This prefix could either be a string to indicate what the prefix should be, or a callable that takes in the bot as its first parameter and :class:`.Message` as its second parameter and returns the prefix. This is to facilitate "dynamic" command prefixes. This callable can be either a regular function or a coroutine.
ru: Префикс команды - это то, с чего должно начинаться сообщение, чтобы бот распознал его как команду. Этот префикс должен быть либо строкой, либо вызываемой функцией, которая принимает как параметры бота и экземпляр класса :class:`.Message` и возвращает префикс. Это позволяет сделать префикс динамическим. При этом функция может быть как синхронной, так и асинхронной

source: The command prefix could also be an iterable of strings indicating that multiple checks for the prefix should be used and the first one to match will be the invocation prefix. You can get this prefix via :attr:`.Context.prefix`. To avoid confusion empty iterables are not allowed.
ru: Префикс может быть и итератором строк, в таком случае первый подошедший префикс будет использован для вызова команды. Для избежания проблем нельзя использовать пустой итератор. Префикс можно получить с помощью :attr:`.Context.prefix`

source: When passing multiple prefixes be careful to not pass a prefix that matches a longer prefix occurring later in the sequence. For example, if the command prefix is ``('!', '!?')`` the ``'!?'`` prefix will never be matched to any message as the previous one matches messages starting with ``!?``. This is especially important when passing an empty string, it should always be last as no prefix after it will be matched.
ru: Если передавать боту несколько префиксов, то учтите, что более ранний префикс не должен быть началом более позднего. Как, к примеру, префиксы не должны быть в порядке ``('!', '!?')``, ибо в таком случае префикс ``'!?'`` никогда не будет использован. Это особенно важно при использовании пустой строки в качестве префикса

source: Whether the commands should be case insensitive. Defaults to ``False``. This attribute does not carry over to groups. You must set it to every group if you require group commands to be case insensitive as well.
ru: Должна ли команда быть нечуствительной к регистру. По умолчанию ``False``

source: type
ru: тип

source: If ``True``, the bot will only listen to commands invoked by itself rather than ignoring itself. If ``False`` (the default) then the bot will ignore itself. This cannot be changed once initialised.
ru: Если ``True``, бот будет слушать только команды, вызванные им же самим. Если ``False`` (по умолчанию), то бот будет себя игнорировать

source: VK API version. Defaults to '5.999' (current latest)
ru: Версия VK API. По умолчанию '5.999' (последняя)

source: Library is not intended to use with API Version lower than '5.103'
ru: Библиотека не будет работать с версиями API ниже '5.103'

source: If bot should force optimal longpoll settings automatically
ru: Должен ли бот автоматически устанавливать оптимальные настройки LongPoll

source: Adds a global check to the bot. This is the non-decorator interface to :meth:`.check` and :meth:`.check_once`.
ru: Добавляет боту глобальную проверку. Это способ добавить :meth:`.check` или :meth:`.check_once` без декоратора.

source: Parameters
ru: Параметры

source: The function that was used as a global check.
ru: Функция, используемая как глобальная проверка

source: If the function should only be called once per :meth:`Command.invoke` call.
ru: Должна ли функция быть вызвана лишь раз при вызове :meth:`Command.invoke`

source: Adds a "cog" to the bot. A cog is a class that has its own event listeners and commands.
ru: Добавляет боту "Cog". Cog - класс, который имеет полностью обособленные события и команды

source: The cog to register to the bot.
ru: Cog, который надо зарегистрировать боту

source: Raises
ru: Вызывает ошибки

source: The cog does not inherit from :class:`.Cog`.
ru: Cog не является наследником класса :class:`.Cog`.

source: An error happened during loading.
ru: Возникла ошибка во время инициализации.

source: Adds a :class:`.Command` or its subclasses into the internal list of commands.
ru: Добавляет команду :class:`.Command` или ее наследника в внутренний лист команд.

source: This is usually not called, instead the :meth:`~.GroupMixin.command` shortcut decorator are used instead.
ru: Обычно не вызывается, вместо него используется декораторы :meth:`~.GroupMixin.command`.

source: The command to add.
ru: Команда, которую надо добавить.

source: If the command is already registered.
ru: Если команда уже зарегистрирована.

source: If the command passed is not a subclass of :class:`.Command`.
ru: Если команда не является сабклассом :class:`.Command`.

source: The non decorator alternative to :meth:`.listen`.
ru: Алтернатива :meth:`.listen` без декоратора.

source: The function to call.
ru: Функция, которую надо вызвать.

source: The name of the event to listen for. Defaults to ``func.__name__``.
ru: Название события, которое надо слушать. По умолчанию название функции (``func.__name__``).

source: Example
ru: Пример

source: A decorator that registers a coroutine as a post-invoke hook. A post-invoke hook is called directly after the command is called. This makes it a useful function to clean-up database connections or any type of clean up required. This post-invoke hook takes a sole parameter, a :class:`.Context`.
ru: Декоратор, вызывающий корутину сразу после вызова команды. Удобно использовать для чистки подключений и еще чего-нибудь. Сама корутина должна принимать один параметр - :class:`.Context`

source: Similar to :meth:`~.Bot.before_invoke`\, this is not called unless checks and argument parsing procedures succeed. This hook is, however, **always** called regardless of the internal command callback raising an error (i.e. :exc:`.CommandInvokeError`\). This makes it ideal for clean-up scenarios.
ru: Аналог :meth:`~.Bot.before_invoke`, но не вызывается пока не пройдут все проверки и парсинг аргументов. Правда, вызвывается вне зависимости от наличия или отсутствия ошибок в команде

source: The coroutine to register as the post-invoke hook.
ru: Корутина, которую надо зарегистрировать как привязанное после вызова

source: The coroutine passed is not actually a coroutine.
ru: Переданная корутина на самом деле не корутина

source: A decorator that registers a coroutine as a pre-invoke hook. A pre-invoke hook is called directly before the command is called. This makes it a useful function to set up database connections or any type of set up required. This pre-invoke hook takes a sole parameter, a :class:`.Context`.
ru: Декоратор, который вызывает корутину прямо перед вызовом команды. Удобно чтобы подготовить подключения, например. Корутина должна принимать один параметр - :class:`.Context`.

source: The :meth:`~.Bot.before_invoke` and :meth:`~.Bot.after_invoke` hooks are only called if all checks and argument parsing procedures pass without error. If any check or argument parsing procedures fail then the hooks are not called.
ru: :meth:`~.Bot.before_invoke` и :meth:`~.Bot.after_invoke` вызываются только если все проверки прошли и команда не выдала ошибок.

source: The coroutine to register as the pre-invoke hook.
ru: Корутина, которую надо привязать до вызова команды

source: Exception.with_traceback(tb) -- set self.__traceback__ to tb and return self.
ru: Тут могла быть ваша реклама

source: Build :class:`.Message` instance from message object :class:`dict`.
ru: Создает экземпляр класса :class:`.Message` из :class:`dict`, содержащего объект сообщения.

source: Normally should not be used at all.
ru: В нормальных условиях не должна вызываться вообще

source: :class:`dict` representation of Message object returned by VK API
ru: :class:`dict`, представляющий объект сообщения, полученный от VK API

source: Returns
ru: Возвращает

source: :class:`.Message` instance representing original object
ru: Экземпляр :class:`.Message`, представляющий изначальное сообщение

source: Return type
ru: Тип возвращаемого значения

source: A decorator that adds a global check to the bot. A global check is similar to a :func:`.check` that is applied on a per command basis except it is run before any command checks have been verified and applies to every command the bot has.
ru: Декоратор, добавляющий глобальную проверку для бота. Глобальная проверка применяется ко всем командам бота.

source: This function can either be a regular function or a coroutine.
ru: Эта функция может быть как обычной функцией, так и корутиной.

source: Similar to a command :func:`.check`\, this takes a single parameter of type :class:`.Context` and can only raise exceptions inherited from :exc:`.CommandError`. .. rubric:: Example
ru: Как и функция :func:`.check` команды, принимает один параметр :class:`.Context` и может вызывать ошибки, наследованные из :exc:`.CommandError`

source: A decorator that adds a "call once" global check to the bot. Unlike regular global checks, this one is called only once per :meth:`Command.invoke` call. Regular global checks are called whenever a command is called or :meth:`.Command.can_run` is called. This type of check bypasses that and ensures that it's called only once, even inside the default help command.
ru: Декоратор, добавляющий одноразовую глобальную проверку боту. Вызывается один раз для каждой команды, после чего не используется

source: Similar to a command :func:`.check`\, this takes a single parameter of type :class:`.Context` and can only raise exceptions inherited from :exc:`.CommandError`.
ru: Как и функция :func:`.check` команды, принимает один параметр :class:`.Context` и может вызывать ошибки, наследованные из :exc:`.CommandError`

source: A read-only mapping of cog name to cog.
ru: Связь названий cog'ов с самими cog'ами, только для чтения

source: A shortcut decorator that invokes :func:`.command` and adds it to the internal command list via :meth:`~.GroupMixin.add_command`.
ru: Декоратор, который добавляет команду в внутренний лист через :meth:`~.GroupMixin.add_command`

source: A unique set of commands without aliases that are registered.
ru: Уникальный набор команд без их альтернативных имен

source: A read-only mapping of extension name to extension.
ru: Связь названия расширений с самими расширениями, только для чтения

source: Gets the cog instance requested. If the cog is not found, ``None`` is returned instead.
ru: Получает запрошенный cog. Если он не найден, возвращает ``None``.

source: The name of the cog you are requesting. This is equivalent to the name passed via keyword argument in class creation or the class name if unspecified.
ru: Название cog'а, который запрашивается

source: Get a :class:`.Command` or subclasses from the internal list of commands.
ru: Получает команду (:class:`.Command` или его сабкласс) из внутреннего списка команд

source: This could also be used as a way to get aliases.
ru: Может использоваться и чтобы получать альтернативные названия

source: The name could be fully qualified (e.g. ``'foo bar'``) will get the subcommand ``bar`` of the group command ``foo``. If a subcommand is not found then ``None`` is returned just as usual.
ru: К примеру, в случае с ``'foo bar'`` вернет название подкоманды ``bar`` из группы команд ``foo``. Если команда не найдена, вернет ``None``

source: The name of the command to get.
ru: Название команды, которую надо получить

source: The command that was requested. If not found, returns ``None``.
ru: Запрошенная команда. Если не найдена, возвращает ``None``.

source: :class:`Command` or subclass
ru: :class:`Command` или сабкласс

source: Returns the invocation context from the message. This is a more low-level counter-part for :meth:`.process_commands` to allow users more fine grained control over the processing. The returned context is not guaranteed to be a valid invocation context, :attr:`.Context.valid` must be checked to make sure it is. If the context is not valid then it is not a valid candidate to be invoked under :meth:`~.Bot.invoke`.
ru: Возвращает контекст для вызова команды из сообщения. Это более низкоуровневая часть :meth:`.process_commands`, которая позволяет более детально управлять обработкой. Возвращенный контест не обязательно будет верным, его надо проверить с помощью :attr:`.Context.valid`

source: The message to get the invocation context from.
ru: Сообщение, из которого надо получить контекст для вызова

source: The factory class that will be used to create the context. By default, this is :class:`.Context`. Should a custom class be provided, it must be similar enough to :class:`.Context`\'s interface.
ru: Класс, который будет использован для создания контекста. По умолчанию = :class:`.Context`. Если предоставлен собственный класс, он должен быть достаточно близок к :class:`.Context`.

source: The invocation context. The type of this can change via the ``cls`` parameter.
ru: Контекст для вызова. Тип зависит от параметра ``cls``

source: Alias for VK Api 'groups.get' method call that returns only one group.
ru: Альтернатива для метода 'groups.get' VK API, возвращает только одну группу

source: Id of group to request
ru: Id группы, которую надо запросить

source: When error is returned by VK API.
ru: Если VK API возвращает ошибку

source: :class:`.Group` instance for requested group
ru: Экземпляр :class:`.Group` для запрошенной группы

source: Alias for VK Api 'groups.get' method call
ru: Альтернатива для метода 'groups.get' VK API

source: List of group ids to request
ru: Список id групп, которые надо запросить

source: List of :class:`.Group` instances for requested groups
ru: Список экземпляров :class:`.Group` для запрошенных групп

source: Gets page for current token, whether it is Group or User
ru: Получает страницу для текущего токена, вне зависимости от того, пользователь это или группа

source: :class:`.Group` or :class:`.User` instance for current token
ru: Экземпляр :class:`.Group` или :class:`.User` в зависимости от токена

source: Gets page for given id, whether it is Group or User
ru: Получает страницу с данным id, вне зависимости от того, группа это или пользователь

source: Id of page to request
ru: Id запрашиваемой страницы

source: Optional. Fields that should be requested from VK Api for users. None by default
ru: Опционально. Поля, которые должны быть запрошены у API. По умолчанию никакие

source: Optional. Name case for user's name to be returned in. 'nom' by default. Can be 'nom', 'gen', 'dat', 'acc', 'ins' or 'abl'
ru: Опционально. Падеж имени пользователя. По умолчанию - 'nom'. Можеть быть 'nom', 'gen', 'dat', 'acc', 'ins' или 'abl'

source: :class:`.Group` or :class:`.User` instance for requested id
ru: Экземпляр :class:`.Group` или :class:`.User` для запрошенного id

source: Gets pages for given ids, whether it is Group or User
ru: Получает страницы для запрошенных id, вне зависимости от того, группа это или пользователь

source: List of ids to request
ru: Список id для запроса

source: Optional. Name case for users' names to be returned in. 'nom' by default. Can be 'nom', 'gen', 'dat', 'acc', 'ins' or 'abl'
ru: Опционально. Падеж имен пользователей. По умолчанию 'nom'. Можеть быть 'nom', 'gen', 'dat', 'acc', 'ins' или 'abl'

source: List of :class:`.Group` or :class:`.User` instances for requested ids
ru: Список экземпляров :class:`.Group` или :class:`.User` для запрошенных id

source: Retrieves the prefix the bot is listening to with the message as a context.
ru: Получает префикс бота для данного сообщения

source: The message context to get the prefix of.
ru: Контекст сообщения, префикс для которого надо получить

source: A list of prefixes or a single prefix that the bot is listening for.
ru: Список префисков или один префикс для данного сообщения

source: Alias for VK Api 'users.get' method call that returns only one user.
ru: Альтернатива методу 'users.get' VK API, возвращает только одного пользователя

source: Id of user to request
ru: Id запрашиваемого пользователя

source: Optional. Fields that should be requested from VK Api. None by default
ru: Опционально. Поля, которые должны быть запрошены у API. По умолчанию никакие

source: :class:`.User` instance for requested user
ru: Экземпляр класса :class:`.User` для запрошенного пользователя

source: Alias for VK Api 'users.get' method call
ru: Альтернатива методу 'users.get' VK API

source: List of user ids to request
ru: Список id пользователей для запроса

source: List of :class:`.User` instances for requested users
ru: Список экземпляров :class:`.User` для запрошенных пользователей

source: Invokes the command given under the invocation context and handles all the internal event dispatch mechanisms.
ru: Вызывает команду с данным контекстом и разбирается со всеми внутренними механизмами вызова событий.

source: The invocation context to invoke.
ru: Контекст для вызова команды.

source: A decorator that registers another function as an external event listener. Basically this allows you to listen to multiple events from different places e.g. such as :func:`.on_ready` The functions being listened to must be a :ref:`coroutine <coroutine>`.
ru: Декоратор, который привязывает функцию к событию. По сути позволяет слушать множество событий из разных мест, таких, как, к примеру :func:`.on_ready`. Привязанная функция должна быть :ref:`корутиной <coroutine>`.

source: Would print one and two in an unspecified order.
ru: Выведет 'one' и 'two' в неопределенном порядке.

source: The function being listened to is not a coroutine.
ru: Привязанная функция - не корутина.

source: Loads an extension. An extension is a python module that contains commands, cogs, or listeners. An extension must have a global function, ``setup`` defined as the entry point on what to do when the extension is loaded. This entry point must have a single argument, the ``bot``.
ru: Загружает расширение. Расширения - модуль python который содержит команды, cog'и и события. Любое расширение должно иметь глобальную функцию ``setup``, определяющую, что расширение должно делать, когда загружено. Эта функция должна принимать 1 аргумент - bot.

source: The extension name to load. It must be dot separated like regular Python imports if accessing a sub-module. e.g. ``foo.test`` if you want to import ``foo/test.py``.
ru: Название расширения, которое надо загрузить. Должно иметь в себе точку, повторяя синтаксис импорта в обычном Python (к примеру foo.test для файла foo/test.py).

source: The extension could not be imported.
ru: Расширение не может быть импортировано.

source: The extension is already loaded.
ru: Расширение уже загружено.

source: The extension does not have a setup function.
ru: У расширения нет функции ``setup``.

source: The extension or its setup function had an execution error.
ru: В расширении или его ``setup`` возникла ошибка.

source: |coro| The default command error handler provided by the bot. By default this prints to :data:`sys.stderr` however it could be overridden to have a different implementation. This only fires if you do not specify any listeners for command error.
ru: |coro| Обработчик ошибок, предоставляемый ботом. По умолчанию выводит информацию о ошибке в :data:`sys.stderr`, но может быть переобъявлен, чтобы делать что-то другое. Вызывается только если в боте нет функций, привязанных к ошибкам.

source: The default error handler provided by the client.
ru: Обработчик ошибок, предоставляемый ботом.

source: By default this prints to :data:`sys.stderr` however it could be overridden to have a different implementation.
ru: По умолчанию выводит информацию о ошибке в :data:`sys.stderr`, но может быть переобъявлен, чтобы делать что-то другое.

source: Check :func:`vk_botting.on_error` for more details.
ru: Посмотрите :func:`vk_botting.on_error` для более детального объяснения

source: This function processes the commands that have been registered to the bot and other groups. Without this coroutine, none of the commands will be triggered.
ru: Функция, обрабатывающая команды, зарегистрированные в боте и прочих источниках. Без этой корутины никакие команды вызваны не будут.

source: By default, this coroutine is called inside the :func:`.on_message_new` event. If you choose to override the :func:`.on_message_new` event, then you should invoke this coroutine as well.
ru: По умолчанию, эта корутина вызывается внутри :func:`.on_message_new`. Если вы переобъявляете :func:`.on_message_new`, не забудьте вызывать эту корутину.

source: This is built using other low level tools, and is equivalent to a call to :meth:`~.Bot.get_context` followed by a call to :meth:`~.Bot.invoke`.
ru: Состоит из более низкоуровневых функций и представляет собой последовательный вызов :meth:`~.Bot.get_context` и :meth:`~.Bot.invoke`.

source: This also checks if the message's author is a bot and doesn't call :meth:`~.Bot.get_context` or :meth:`~.Bot.invoke` if so.
ru: Так же проверяет, является ли автор сообщения ботом и не вызывает :meth:`~.Bot.get_context` и :meth:`~.Bot.invoke` в таком случае.

source: The message to process commands for.
ru: Сообщение, команды из которого надо обрабатывать

source: Atomically reloads an extension. This replaces the extension with the same extension, only refreshed. This is equivalent to a :meth:`unload_extension` followed by a :meth:`load_extension` except done in an atomic way. That is, if an operation fails mid-reload then the bot will roll-back to the prior working state.
ru: Автоматически перезагружает расширение. Заменяет расширение перезагруженной версией самого себя. Представляет собой последовательный вызов :meth:`unload_extension` и :meth:`load_extension`, но рассчитанный на возможные ошибки, в случае которых бот возвращается к предыдущей, рабочей версии расширения.

source: The extension name to reload. It must be dot separated like regular Python imports if accessing a sub-module. e.g. ``foo.test`` if you want to import ``foo/test.py``.
ru: Имя расширения, которое надо перезагрузить. Должно иметь в себе точку, повторяя синтаксис импорта в обычном Python (к примеру foo.test для файла foo/test.py).

source: The extension was not loaded.
ru: Расширение не было загружено.

source: The extension setup function had an execution error.
ru: В функции ``setup`` расширения произошла ошибка.

source: Removes a global check from the bot. This function is idempotent and will not raise an exception if the function is not in the global checks.
ru: Удаляет глобальную проверку из бота. Эта функция не вызывает ошибку даже если такой глобальной проверки не было.

source: The function to remove from the global checks.
ru: Функция, которую надо удалить из глобальных проверок.

source: If the function was added with ``call_once=True`` in the :meth:`.Bot.add_check` call or using :meth:`.check_once`.
ru: Была ли функция была добавлена с параметром ``call_once=True``

source: Removes a cog from the bot. All registered commands and event listeners that the cog has registered will be removed as well. If no cog is found then this method has no effect.
ru: Удаляет cog из бота. Все связаные с ним команды и события тоже будут удалены. Если cog не найден, ничего не делает.
