Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/cogs.po
Languages: ru

source: There comes a point in your bot's development when you want to organize a collection of commands, listeners, and some state into one class. Cogs allow you to do just that.
ru: В определенный момент при разработке бота возникнет ситуация, в которой вы захотите организовать команды, события и какие-то переменные состояния в отдельный класс. Cog'и существуют как раз для этого.

source: The gist:
ru: Основы:

source: Each cog is a Python class that subclasses :class:`.cog.Cog`.
ru: Каждый cog - класс который является сабклассом :class:`.cog.Cog`.

source: Every command is marked with the :func:`~.commands.command` decorator.
ru: Каждая команда объявляется с декоратором :func:`.commands.command`.

source: Every listener is marked with the :meth:`.cog.Cog.listener` decorator.
ru: Каждый листенер объявляется с декоратором :meth:`.cog.Cog.listener`.

source: Cogs are then registered with the :meth:`.Bot.add_cog` call.
ru: Cog'и добавляются в бота с помощью метода :meth:`.Bot.add_cog`.

source: Cogs are subsequently removed with the :meth:`.Bot.remove_cog` call.
ru: После чего можно использовать :meth:`.Bot.remove_cog` чтобы удалить их.

source: Quick Example
ru: Пример

source: This example cog defines a ``Greetings`` category for your commands, with a single :ref:`command <vk_api_commands>` named ``hello`` as well as a listener to listen to an :ref:`Event <vk_api_events>`.
ru: Этот пример создает cog с названием ``Greetings``, который содержит одну :ref:`команду <vk_api_commands>` с названием ``hello`` и одно :ref:`событие <vk_api_events>`.

source: A couple of technical notes to take into consideration:
ru: Пара технических деталей которые стоит взять на заметку:

source: All listeners must be explicitly marked via decorator, :meth:`~.cog.Cog.listener`.
ru: Все листенеры должны быть объявлены с декоратором :meth:`~.cog.Cog.listener`.

source: The name of the cog is automatically derived from the class name but can be overridden. See :ref:`vk_api_cogs_meta_options`.
ru: Название cog'а автоматически берется из названия класса, но может быть переназначено (см. :ref:`vk_api_cogs_meta_options`).

source: All commands must now take a ``self`` parameter to allow usage of instance attributes that can be used to maintain state.
ru: Все команды теперь должны содержать параметр ``self`` для возможности использования аттрибутов экземпляра которые используются для сохранения состояния.

source: Cog Registration
ru: Добавление Cog'ов

source: Once you have defined your cogs, you need to tell the bot to register the cogs to be used. We do this via the :meth:`~.bot.Bot.add_cog` method.
ru: После объявления cog'ов, их надо добавить в бота с помощью метода :meth:`~.bot.Bot.add_cog`.

source: This binds the cog to the bot, adding all commands and listeners to the bot automatically.
ru: Этот метод привязывает cog к боту, автоматически добавляя в него все команды и события.

source: Note that we reference the cog by name, which we can override through :ref:`vk_api_cogs_meta_options`. So if we ever want to remove the cog eventually, we would have to do the following.
ru: Важно заметить, что cog упоминается с помощью названия, которое можно изменить через :ref:`vk_api_cogs_meta_options`. Так что если этот ког в определенный момент необходимо удалить, это делается так.

source: Using Cogs
ru: Использование Cog'ов

source: Just as we remove a cog by its name, we can also retrieve it by its name as well. This allows us to use a cog as an inter-command communication protocol to share data. For example:
ru: Так же как и удалить, cog можно получить по его названию. Это позволяет использовать cog для взаимодействия между командами. Например:

source: Special Methods
ru: Особые методы

source: As cogs get more complicated and have more commands, there comes a point where we want to customise the behaviour of the entire cog or bot.
ru: Когда cog'и становятся более сложными и количество команд в них растет, наступает момент когда их хочется более сильно персонализировать.

source: They are as follows:
ru: Для этого есть следующие методы:

source: You can visit the reference to get more detail.
ru: Для более подробной информации можно посмотреть на эти методы в справочнике.

source: Meta Options
ru: Настройки метаданных

source: At the heart of a cog resides a metaclass, :class:`.cog.CogMeta`, which can take various options to customise some of the behaviour. To do this, we pass keyword arguments to the class definition line. For example, to change the cog name we can pass the ``name`` keyword argument as follows:
ru: В основе cog'а лежит метакласс :class:`.cog.CogMeta`, который принимает различные настройки, позволяющие персонализировать некоторые аспекты cog'ов. Для этого необходимо передать аргументы с ключевыми словами в строку объявления класса. Например чтобы поменять имя cog'а, можно передать аргумент ``name`` примерно так:

source: To see more options that you can set, see the documentation of :class:`.cog.CogMeta`.
ru: Больше опций можно найти в справке к классу :class:`.cog.CogMeta`.

source: Inspection
ru: Просмотр свойств

source: Since cogs ultimately are classes, we have some tools to help us inspect certain properties of the cog.
ru: Так как cog'и по сути являются просто классами, некоторые их свойства можно просматривать.

source: To get a :class:`list` of commands, we can use :meth:`.Cog.get_commands`. ::
ru: Чтобы получить :class:`list` команд, можно использовать :meth:`.Cog.get_commands`. ::

source: To do the same with listeners, we can query them with :meth:`.Cog.get_listeners`. This returns a list of tuples -- the first element being the listener name and the second one being the actual function itself. ::
ru: Чтобы получить события, можно использовать :meth:`.Cog.get_listeners`. Этот метод возвращает список кортежей -- первый элемент которого - название события, а второй - сама функция. ::
