Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/commands.po
Languages: ru

source: Commands
ru: Команды

source: One of the most appealing aspect of the library is how easy it is to define commands and how you can arbitrarily nest commands to have a rich command system.
ru: Один из самых привлекательных аспектов библиотеки - простота создания команд и богатые настройки для них

source: Commands are defined by attaching it to a regular Python function. The command is then invoked by the user using a similar signature to the Python function.
ru: Команды объявляются прикреплением их к обычной функции. После чего команды вызываются пользователем через сообщения

source: For example, in the given command definition:
ru: К примеру, в данной команде:

source: With the following prefix (``$``), it would be invoked by the user via:
ru: С данным префиксом (``$``), команда будет вызвана пользователем с помощью:

source: A command must always have at least one parameter, ``ctx``, which is the :class:`.Context` as the first one.
ru: Команда всегда должна иметь как минимум один параметр, ``ctx``, который является экземпляром :class:`.Context` как свой первый параметр.

source: There are two ways of registering a command. The first one is by using :meth:`.Bot.command` decorator, as seen in the example above. The second is using the :func:`.command` decorator followed by :meth:`.Bot.add_command` on the instance.
ru: Есть 2 способа зарегистрировать команду. Первый - используя декоратор :meth:`.Bot.command` как в примере выше. Второй - с помощью декоратора :func:`.command` и метода :meth:`.Bot.add_command`

source: Essentially, these two are equivalent: ::
ru: По сути, они аналогичны: ::

source: Since the :meth:`.Bot.command` decorator is shorter and easier to comprehend, it will be the one used throughout the documentation here.
ru: Так как декоратор :meth:`.Bot.command` короче и удобнее, он будет использоваться во всей документации

source: Any parameter that is accepted by the :class:`.Command` constructor can be passed into the decorator. For example, to change the name to something other than the function would be as simple as doing this:
ru: Любой параметр, принимаемый конструктором класса :class:`.Command`, может быть передан в декоратор. К примеру, для смены названия команды на что-то отличное от имени функции надо просто объявить ее так:

source: Parameters
ru: Параметры

source: Since we define commands by making Python functions, we also define the argument passing behaviour by the function parameters.
ru: Так как команды являются, по сути, функциями, мы можем в том числе объявить характер парсинга аргументов функцией

source: Certain parameter types do different things in the user side and most forms of parameter types are supported.
ru: Некоторые типы параметров ведут себя по разному на стороне пользователя и большая часть параметров поддерживается

source: Positional
ru: Позиционные

source: The most basic form of parameter passing is the positional parameter. This is where we pass a parameter as-is:
ru: Самый базовый вид параметра - позиционный. Это когда параметр передается как есть:

source: On the bot using side, you can provide positional arguments by just passing a regular string:
ru: На стороне пользователя, передать параметр можно просто передавая обычную строку

source: Since positional arguments are just regular Python arguments, you can have as many as you want:
ru: Так как позиционные аргументы - это просто обычные аргументы, их может быть сколь угодно много

source: Variable
ru: Переменные

source: Sometimes you want users to pass in an undetermined number of parameters. The library supports this similar to how variable list parameters are done in Python:
ru: Иногда необходимо, чтобы пользователь мог отправить неопределенное число параметров. Библиотека делает это аналогично тому, как списки параметров делаются в Python

source: This allows our user to accept either one or many arguments as they please.
ru: Это позволяет пользователю передавать один или множество аргументов по желанию

source: Do note that similar to the Python function behaviour, a user can technically pass no arguments at all.
ru: Учтите, что так как команды работают аналогично функциям, пользователь может вообще не передавать аргументы

source: Since the ``args`` variable is a :class:`py:tuple`, you can do anything you would usually do with one.
ru: Так как переменная ``args`` - типа :class:`py:tuple`, с ней можно делать все, что и с ним

source: Keyword-Only Arguments
ru: Аргументы с ключевыми словами

source: When you want to handle parsing of the argument yourself or do not feel like you want to wrap multi-word user input into quotes, you can ask the library to give you the rest as a single argument. We do this by using a **keyword-only argument**, seen below:
ru: Если вы хотите обрабатывать аргументы сами или не хотите заставлять пользователя использовать кавычки, можно принимать в функцию оставшиеся аргументы как одну строку. Делается это с помощью аргументов с ключевыми словами, так:

source: You can only have one keyword-only argument due to parsing ambiguities.
ru: Такой аргумент может быть только один в связи с особенностями парсинга

source: By default, the keyword-only arguments are stripped of white space to make it easier to work with. This behaviour can be toggled by the :attr:`.Command.rest_is_raw` argument in the decorator.
ru: По умолчанию такие аргументы автоматически очищаются от пробелов на краях для удобства, но это можно поменять с помощью передачи атрибута :attr:`.Command.rest_is_raw` в декоратор

source: Invocation Context
ru: Контекст Вызова

source: As seen earlier, every command must take at least a single parameter, called the :class:`context.Context`.
ru: Как было показано ранее, все команды должны иметь как минимум один параметр, называемый контекстом (:class:`context.Context`)

source: This parameter gives you access to something called the "invocation context". Essentially all the information you need to know how the command was executed. It contains a lot of useful information:
ru: Этот параметр дает вам доступ к так называемому "контексту вызова". По сути он содержит всю информацию, необходимую для понимания, как и где была вызвана команда. Например:

source: :attr:`.Context.from_id` to fetch the id of message author.
ru: :attr:`.Context.from_id` - id автора сообщения

source: :attr:`.Context.peer_id` to fetch id of conversation.
ru: :attr:`.Context.peer_id` - id диалога, в котором пришло сообщение

source: :meth:`.Context.get_user` to fetch the :class:`User` that called the command.
ru: :meth:`.Context.get_user` возвращает автора как экземпляр класса :class:`User`

source: :meth:`.Context.send` to send a message to the conversation the command was used in.
ru: :meth:`.Context.send` можно использовать для отправки сообщений в диалог, в котором была использована команда

source: The context implements the :class:`abstract.Messageable` interface, so anything you can do on a :class:`abstract.Messageable` you can do on the :class:`context.Context`.
ru: Контекст является реализацией класса :class:`abstract.Messageable`, так что все, что можно делать с ним, можно делать и с :class:`context.Context`

source: Converters
ru: Преобразователи

source: Adding bot arguments with function parameters is only the first step in defining your bot's command interface. To actually make use of the arguments, we usually want to convert the data into a target type. We call these Converters.
ru: Аргументы бота как параметры для функции - только первый шаг на пути построения командного интерфейса бота. Для удобства использования аргументов, их обычно стоит преобразовать в нужный тип. Это можно сделать с помощью преобразователей.

source: Converters come in a few flavours:
ru: Преобразователи бывают разными:

source: A regular callable object that takes an argument as a sole parameter and returns a different type.
ru: Обычная функция, которая принимает как аргумент один параметр и возвращает его другого типа.

source: These range from your own function, to something like :class:`bool` or :class:`int`.
ru: Они могут быть как вашими собственными функциями, так и, к примеру, :class:`bool` или :class:`int`.

source: A custom class that inherits from :class:`conversions.Converter`.
ru: Собственный класс должен быть наследником :class:`conversions.Converter`

source: Basic Converters
ru: Базовые преобразователи

source: At its core, a basic converter is a callable that takes in an argument and turns it into something else.
ru: По сути, базовый преобразователь - функция, которая получает на вход аргумент и преобразует его во что-то иное.

source: For example, if we wanted to add two numbers together, we could request that they are turned into integers for us by specifying the converter:
ru: К примеру, если надо добавить два числа вместе, то можно указать, что они должны быть целыми числами:

source: We specify converters by using something called a **function annotation**. This is a Python 3 exclusive feature that was introduced in :pep:`3107`.
ru: Преобразователи указываются с помощью так называемых **аннотаций функции**. Это деталь, эксклюзивная для Python 3 и добавленная в :pep:`3107`.

source: This works with any callable, such as a function that would convert a string to all upper-case:
ru: Это работает со всеми функциями. Например, для преобразования строки в верхний регистр:

source: bool
ru: Логические переменные

source: Unlike the other basic converters, the :class:`bool` converter is treated slightly different. Instead of casting directly to the :class:`bool` type, which would result in any non-empty argument returning ``True``, it instead evaluates the argument as ``True`` or ``False`` based on its given content:
ru: В отличии от других базовых преобразователей, преобразование в :class:`bool` работает немного по другому. Вместо использования типа :class:`bool` напрямую, он преобразовывает аргумент в ``True`` или ``False`` в зависимости от его значения:

source: Advanced Converters
ru: Продвинутые Преобразователи

source: Sometimes a basic converter doesn't have enough information that we need. For example, sometimes we want to get some information from the :class:`Message` that called the command or we want to do some asynchronous processing.
ru: Обычно простого преобразователя может не хватить для наших нужд. Например, если требуется получить дополнительную информацию от сообщения (:class:`Message`), вызвавшего команду или требуется какая-то асинхронная обработка.

source: For this, the library provides the :class:`conversions.Converter` interface. This allows you to have access to the :class:`.Context` and have the callable be asynchronous. Defining a custom converter using this interface requires overriding a single method, :meth:`.Converter.convert`.
ru: В таком случае стоит использовать собственный преобразователь как наследника :class:`conversions.Converter`. Это позволяет получить доступ к :class:`.Context` и объявлять функцию как асинхронную. Это требует замены одного метода - :meth:`.Converter.convert`

source: An example converter:
ru: Пример преобразователя:

source: The converter provided can either be constructed or not. Essentially these two are equivalent:
ru: При этом преобразователь может передаваться и как класс, и как экземпляр этого класса. По сути это одно и то же:

source: Having the possibility of the converter be constructed allows you to set up some state in the converter's ``__init__`` for fine tuning the converter.
ru: Возможность передавать экземпляр класса требуется для возможного использования ``__init__`` для более детальной настройки преобразователя.

source: If a converter fails to convert an argument to its designated target type, the :exc:`.BadArgument` exception must be raised.
ru: Если преобразователю не удается преобразовать аргумент, то вызывается ошибка :exc:`.BadArgument`.

source: Error Handling
ru: Обработка Ошибок

source: When our commands fail to parse we will, by default, receive a noisy error in ``stderr`` of our console that tells us that an error has happened and has been silently ignored.
ru: По умолчанию, когда команда вызывает ошибку, мы получим страшное сообщение в ``stderr`` консоли которое будет говорить о том, что за ошибка была проигнорирована.

source: In order to handle our errors, we must use something called an error handler. There is a global error handler, called :func:`on_command_error` which works like any other event in the :ref:`vk_api_events`. This global error handler is called for every error reached.
ru: Чтобы обрабатывать ошибки, необходимо использовать так называемый обработчик ошибок. Глобальный обработчик ошибок (:func:`on_command_error`) работает как и любое другое событие в :ref:`vk_api_events` и вызывается при каждой ошибке.

source: Most of the time however, we want to handle an error local to the command itself. Luckily, commands come with local error handlers that allow us to do just that. First we decorate an error handler function with :meth:`.Command.error`:
ru: Большую часть времени, однако, требуется обрабатывать ошибку, которая возникает в конкретной команде. В таком случае можно объявить команде локальный обработчик ошибок с помощью :meth:`.Command.error`.

source: The first parameter of the error handler is the :class:`.Context` while the second one is an exception that is derived from :exc:`.CommandError`. A list of errors is found in the :ref:`vk_api_errors` page of the documentation.
ru: Первым параметром этого обработчика всегда должен быть контекст (:class:`.Context`), в то время как второй - ошибка, являющаяся наследником :exc:`.CommandError`. Список ошибок можно найти на странице :ref:`vk_api_errors`.

source: Checks
ru: Проверки

source: There are cases when we don't want a user to use our commands. They don't have permissions to do so or maybe we blocked them from using our bot earlier. The library comes with full support for these things in a concept called a check.
ru: Есть случаи, в которых пользователь не должен использовать команды. Может быть, у них нет для этого права или же им заблокирован доступ к боту. Для таких случаев библиотека предоставляет концепт, называемый проверками.

source: A check is a basic predicate that can take in a :class:`.Context` as its sole parameter. Within it, you have the following options:
ru: Проверка - функция, принимающая на вход лишь контекст (:class:`.Context`). Внутри нее можно сделать следующее:

source: Return ``True`` to signal that the person can run the command.
ru: Вернуть ``True``, чтобы показать, что пользователь может использовать команду.

source: Return ``False`` to signal that the person cannot run the command.
ru: Вернуть ``False``, чтобы показать, что пользователь не может использовать команду.

source: Raise a :exc:`.CommandError` derived exception to signal the person cannot run the command.
ru: Вызвать :exc:`.CommandError` или ее наследника, чтобы показать, что пользователь не может использовать команду.

source: This allows you to have custom error messages for you to handle in the :ref:`error handlers <vk_api_error_handler>`.
ru: Это позволяет иметь пользовательские сообщения об ошибках для обработки их с помощью :ref:`обработчиков ошибок <vk_api_error_handler>`.

source: To register a check for a command, we would have two ways of doing so. The first is using the :meth:`limiters.check` decorator. For example:
ru: Привязать проверку к команде можно двумя способами. Первый - используя декоратор :meth:`limiters.check`. К примеру:

source: This would only evaluate the command if the function ``is_owner`` returns ``True``. Sometimes we re-use a check often and want to split it into its own decorator. To do that we can just add another level of depth:
ru: Этот пример вызовет команду только если функция ``is_owner`` вернет ``True``. Иногда, в случае частого использования проверки, ее можно превратить в декоратор. Для этого просто надо добавить еще один уровень вложенности:

source: Library actually provides a premade check to check if user is in given list (:func:`limitest.in_user_list`):
ru: Так как он часто используется, библиотека предоставляет заранее готовый декоратор для проверки наличия пользователя в списке (:func:`limitest.in_user_list`):

source: When multiple checks are specified, **all** of them must be ``True``:
ru: Когда объявлено несколько проверок, **все** они должны вернуть ``True``:

source: If any of those checks fail in the example above, then the command will not be run.
ru: В примере выше, если любая из проверок провалится, команда не будет работать

source: When an error happens, the error is propagated to the :ref:`error handlers <vk_api_error_handler>`. If you do not raise a custom :exc:`.CommandError` derived exception, then it will get wrapped up into a :exc:`.CheckFailure` exception as so:
ru: Когда происходит ошибка, она передается :ref:`обработчикам ошибок <vk_api_error_handler>`. Если вы не вызвали пользовательскую ошибку, являющуюся :exc:`.CommandError` или ее наследником, то ошибка будет обернута в :exc:`.CheckFailure` и ее можно обработать так:

source: Global Checks
ru: Глобальные Проверки

source: Sometimes we want to apply a check to **every** command, not just certain commands. The library supports this as well using the global check concept.
ru: Иногда необходимо применить проверку к **каждой** команде, а не только к конкретной. Библиотека так тоже может, засчет глобальных проверок.

source: Global checks work similarly to regular checks except they are registered with the :func:`.Bot.check` decorator.
ru: Глобальные проверки работают аналогично обычным, но регистрируются с помощью декоратора :func:`.Bot.check`

source: For example, to block all DMs we could do the following:
ru: К примеру, чтобы заблокировать все личные сообщения, можно сделать следующее:

source: Be careful on how you write your global checks, as it could also lock you out of your own bot.
ru: Будьте аккуратны с глобальными проверками, ибо они могут ограничить вам доступ к собственному боту.
