Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: ru

source: Introduction
ru: Вступление

source: This is the documentation for vk-botting, a library for Python to aid in creating applications that utilise the VK API.
ru: Это документация для vk-botting - библиотеки, призванной помочь создавать чат-ботов, использующих VK API.

source: Prerequisites
ru: Требования

source: vk-botting works with Python 3.6.0 or higher. Support for earlier versions of Python is not provided. Python 2.7 or lower is not supported.
ru: vk-botting работает с Python 3.6.0 или выше. Более низкие версии не поддерживаются. Python 2.7 и ниже тоже.

source: Installing
ru: Установка

source: You can get the library directly from PyPI: ::
ru: Библиотеку можно скачать прямо с PyPi: ::

source: If you are using Windows, then the following should be used instead: ::
ru: Если вы используете Windows, то можно сделать так: ::

source: Virtual Environments
ru: Виртуальные среды

source: Sometimes you want to keep libraries from polluting system installs or use a different version of libraries than the ones installed on the system. You might also not have permissions to install libaries system-wide. For this purpose, the standard library as of Python 3.3 comes with a concept called "Virtual Environment"s to help maintain these separate versions.
ru: Иногда необходимо использовать библиотеки с версией отличной от установленных в системе или просто не хочется засорять систему. Или, возможно, у вас нет доступа к установке библиотек в систему. В таком случае, начиная с Python 3.3 в стандартную библиотеку входят так называемые "Virtual Environment"s, которые могут помочь решить подобные проблемы.

source: A more in-depth tutorial is found on `Virtual Environments and Packages <https://docs.python.org/3/tutorial/venv.html>`_.
ru: Более детальную информацию можно найти на `Virtual Environments and Packages <https://docs.python.org/3/tutorial/venv.html>`_.

source: However, for the quick and dirty:
ru: Но, для тех, кому лень читать:

source: Go to your project's working directory:
ru: Зайдите в папку своего проекта:

source: Activate the virtual environment:
ru: Активируйте виртуальную среду:

source: On Windows you activate it with:
ru: Если вы используете Windows, то так:

source: Use pip like usual:
ru: И можно использовать pip как обычно:

source: Congratulations. You now have a virtual environment all set up.
ru: Поздравляю, у вас есть готовая виртуальная среда.

source: Basic Concepts
ru: Базовые концепты

source: vk-botting revolves around the concept of :ref:`events <vk_api_events>`. An event is something you listen to and then respond to. For example, when a message happens, you will receive an event about it that you can respond to.
ru: vk-botting основан на :ref:`событиях <vk_api_events>`. События можно ловить и обрабатывать. Например, когда приходит сообщение, вы узнаете об этом и сможете ответить.

source: A quick example to showcase how events work:
ru: Небольшой пример работы событий:
