Repository: 2sweetheart2/vk-botting
Catalog: docs/locale/*/LC_MESSAGES/vk.po
Languages: ru

source: Creating a Bot
ru: Создание Бота

source: In order to work with the library and the VK API in general, we must first create a VK Bot.
ru: Для работы с библиотекой и VK API в целом необходимо сначала создать бота.

source: Creating a Bot is a pretty straightforward process.
ru: Создание бота довольно прямолинейно.

source: Make sure you're logged on to the `VK website <https://vk.com/>`_.
ru: Убедитесь, что вы залогинены на `сайте ВК <https://vk.com/>`_.

source: Go to the group you are administrator of.
ru: Зайдите на страницу группы, администратором которой являетесь.

source: Navigate to the Manage -> Messages.
ru: Перейдите в Управление -> Сообщения.

source: Enable "Community messages".
ru: Включите "Сообщения сообщества".

source: Navigate to the Settings -> API usage -> Access tokens.
ru: Перейдите в Настройки -> Работа с API -> Ключи доступа.

source: Click on the "Create token" button.
ru: Нажмите на кнопку "Создать ключ".

source: Allow everything you see necessary and click on the "Create" button.
ru: Разрешите все, что видите нужным, и нажмите на кнопку "Создать".

source: Confirm the action if prompted.
ru: Подтвердите действие, если требуется.

source: Copy the new access token and store it somewhere safe.
ru: Скопируйте токен в какое-нибудь безопасное место.

source: It should be worth noting that this token is essentially your bot's password. You should **never** share this to someone else. In doing so, someone can log in to your bot and do malicious things, such as removing wall posts, spamming messages or even banning all members.
ru: Важно отметить, что токен по сути равносилен паролю бота. **Никогда** не отправляйте его кому бы то ни было. Если вы так сделаете, человек сможет использовать его во вредоносных целях. Он может поудалять все посты, заспамить пользователей сообщениями или даже просто всех забанить.

source: The possibilities are endless, so **do not share this token.**
ru: Возможности безграничны, так что **никогда не передавайте токен третьим лицам.**

source: If you accidentally leaked your token, click the "Delete token" button as soon as possible. This revokes your old token and you can then generate a new one. Now you need to use the new token to login.
ru: Если вы случайно слили ваш токен, нажмите кнопку "Удалить ключ" как можно скорее. Это удалит ваш старый токен, и вам надо будет создать новый и использовать его для бота.

source: And that's it. You now have a bot account and you can login with that token.
ru: Все. Теперь у вас есть бот и вы можете использовать его токен.

source: Enabling Longpoll
ru: Включение Longpoll

source: For the Bot to be able to catch events, you first have to enable Longpoll.
ru: Для того, чтобы бот мог работать с событиями, надо включить Longpoll

source: Library can do it automatically if you use :func:`force` parameter
ru: Библиотека может сделать это автоматически, для этого используйте параметр force при создании бота

source: Enable "Long Poll API" and set "API version" to latest possible (highest number after dot).
ru: Включите "Long Poll API" и установите параметр "Версия API" на последний доступный (наибольшее число после точки).

source: Check all of the events you need. If you do not know what to check, check everything.
ru: Поставьте галочку на всех событиях, которые вам нужны. Если не знаете, куда ставить, поставьте везде.

source: Now you should be able to use the library.
ru: Теперь вы можете использовать библиотеку
